uyencorki/uvc-ai-stm32/Lib/Camera_Middleware/ISP_Library/isp/USBX/Src/usb_desc.c
/**
 ******************************************************************************
 * @file    usb_desc.c
 * @author  AIS Application Team
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "usb_desc.h"

#include <assert.h>
#include <stdint.h>
#include <string.h>

#include "stm32n6xx_hal.h"

#include "usbx_conf.h"
#include "usbx_codes.h"
#include "usb_desc_internal.h"

#define container_of(ptr, type, member) (type *) ((unsigned char *)ptr - offsetof(type,member))
#define ARRAY_LEN(a) (sizeof(a)/sizeof(a[0]))

#define DEV_MANUFACTURER_STRING      "STMicroelectronics"
#define DEV_PRODUCT_STRING           "STM32 uvc"

static void gen_serial_int_to_ascii(uint32_t value, char *p_buf, uint8_t len)
{
  uint8_t idx = 0U;

  for (idx = 0U ; idx < len ; idx ++)
  {
    if (((value >> 28)) < 0xAU)
      p_buf[idx] = (value >> 28) + '0';
    else
      p_buf[idx] = (value >> 28) + 'A' - 10U;
    value = value << 4;
  }
}

static void gen_serial(char serial[13])
{
  uint32_t deviceserial0;
  uint32_t deviceserial1;
  uint32_t deviceserial2;

  deviceserial0 = HAL_GetUIDw0();
  deviceserial1 = HAL_GetUIDw1();
  deviceserial2 = HAL_GetUIDw2();
  deviceserial0 += deviceserial2;

  gen_serial_int_to_ascii(deviceserial0, &serial[0], 8);
  gen_serial_int_to_ascii(deviceserial1, &serial[8], 4);
  serial[12] = '\0';
}

static int usb_get_string_desc(void *p_dst, int dst_len, char *name)
{
  int desc_len = 2 + strlen(name) * 2;
  uint8_t *dst = p_dst;

  if (dst_len < desc_len)
    return -1;

  *dst++ = desc_len; /* bLength = desc_len */
  *dst++ = 0x03; /* string descriptor */

  while (*name) {
    *dst++ = *name++;
    *dst++ = 0;
  }

  return dst_len;
}

static int get_children_len(struct usb_desc_head *child)
{
  int total_len = 0;

  while (child) {
    total_len += child->bLength + get_children_len(child->children);
    child = child->next_child;
  }

  return total_len;
}

static void append_as_child(struct usb_desc_head *parent, struct usb_desc_head *child)
{
  struct usb_desc_head *prev_child_head = parent->children;

  parent->children = child;
  child->next_child = prev_child_head;
}

static int gen_default_desc(struct usb_desc_head *head, uint8_t *p_dst, int dst_len)
{
  if (head->bLength > dst_len)
    return -1;

  memcpy(p_dst, head->raw, head->bLength);
  if (head->next) {
    assert(head->next->gen);
    return head->next->gen(head->next, p_dst + head->bLength, dst_len - head->bLength);
  } else {
    return dst_len - head->bLength;
  }
}

static void update(struct usb_desc_head *head)
{
  while (head) {
    if (head->update)
      head->update(head);
    head = head->next;
  }
}

static int generate(struct usb_desc_head *head, uint8_t *p_dst, int dst_len)
{
  int ret;

  ret = head->gen(head, p_dst, dst_len);

  return ret < 0 ? ret : dst_len - ret;
}

static void build_uvc_dev_desc(struct usb_dev_desc *desc, struct usb_desc_head *next, uvc_desc_conf *p_conf,
                               int idx_manufacturer, int idx_product, int idx_serial)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x01;
  desc->raw.bcdUSB = 0x0200;
  desc->raw.bDeviceClass = 0xEF;
  desc->raw.bDeviceSubClass = 0x02;
  desc->raw.bDeviceProtocol = 0x01;
  desc->raw.bMaxPacketSize = 64;
  desc->raw.idVendor = 0x0483;
  desc->raw.idProduct = 0x5740;
  desc->raw.bcdDevice = 0x0100;
  desc->raw.iManufacturer = idx_manufacturer;
  desc->raw.iProduct = idx_product;
  desc->raw.iSerialNumber = idx_serial;
  desc->raw.bNumConfigurations = 1;
}

static void build_dev_desc(struct usb_dev_desc *desc, struct usb_desc_head *next, usb_desc_conf *p_conf,
                           int idx_manufacturer, int idx_product, int idx_serial)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x01;
  desc->raw.bcdUSB = 0x0200;
  desc->raw.bDeviceClass = 0x02;
  desc->raw.bDeviceSubClass = 0x00;
  desc->raw.bDeviceProtocol = 0x00;
  desc->raw.bMaxPacketSize = 64;
  desc->raw.idVendor = 0x0483;
  desc->raw.idProduct = 0x5740;
  desc->raw.bcdDevice = 0x0100;
  desc->raw.iManufacturer = idx_manufacturer;
  desc->raw.iProduct = idx_product;
  desc->raw.iSerialNumber = idx_serial;
  desc->raw.bNumConfigurations = 1;
}

static void update_usb_conf_desc(struct usb_desc_head *head)
{
  struct usb_conf_desc *desc = container_of(head, struct usb_conf_desc, head);

  desc->raw.wTotalLength += get_children_len(desc->head.children);
}

static void build_usb_conf_desc(struct usb_conf_desc *desc, struct usb_desc_head *next)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.update = update_usb_conf_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x02;
  desc->raw.wTotalLength = desc->raw.bLength;
  desc->raw.bNumInterfaces = 2;
  desc->raw.bConfigurationValue = 1;
  desc->raw.iConfiguration = 0;
  desc->raw.bmAttributes = 0xc0; /* self powered */
  desc->raw.bMaxPower = 50; /* 100 ma */
}

static void build_std_itf_desc(struct std_itf_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
                               int ep_nb, int itf_nf, int class, int subclass, int protocol)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x04;
  desc->raw.bInterfaceNumber = itf_nf;
  desc->raw.bAlternateSetting = 0;
  desc->raw.bNumEndpoints = ep_nb;
  desc->raw.bInterfaceClass = class; /* Communications Interface Class */
  desc->raw.bInterfaceSubClass = subclass; /* Abstract Control Model */
  desc->raw.bInterfaceProtocol = protocol; /* AT Commands: V.250 etc */
  desc->raw.iInterface = 0;

  append_as_child(parent, &desc->head);
}

