uyencorki/uvc-ai-stm32/Lib/Camera_Middleware/ISP_Library/isp/USBX/Src/usb_desc.c
static void build_cdc_hdr_func_desc(struct cdc_hdr_func_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = 0x00; /* Header Functional Descriptor */
  desc->raw.bcdCDC = 0x0110; /* CDC 1.1 */

  append_as_child(parent, &desc->head);
}

static void build_cdc_acm_func_desc(struct cdc_acm_func_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = 0x02; /* Abstract Control Management Functional Descriptor */
  desc->raw.bmCapabilities = 0x0e;

  append_as_child(parent, &desc->head);
}

static void build_cdc_union_func_desc(struct cdc_union_func_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
                                      int ctrl_itf, int data_itf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = 0x06; /* Union Functional Descriptor */
  desc->raw.bControlInterface = ctrl_itf;
  desc->raw.bSubordinateInterface0 = data_itf;

  append_as_child(parent, &desc->head);
}

static void build_cdc_call_mgt_func_desc(struct cdc_call_mgt_func_desc *desc, struct usb_desc_head *next,
                                         struct usb_desc_head *parent, int data_itf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = 0x01; /* Call Management Functional Descriptor */
  desc->raw.bmCapabilities = 0x00;
  desc->raw.bDataInterface = data_itf;

  append_as_child(parent, &desc->head);
}

static void build_std_ep_desc(struct std_ep_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
                              int addr, int attribute, int packet_size, int interval)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 5;
  desc->raw.bEndpointAddress = addr;
  desc->raw.bmAttributes = attribute;
  desc->raw.wMaxPacketSize = packet_size;
  desc->raw.bInterval = interval;

  append_as_child(parent, &desc->head);
}

static void build_std_iad_desc(struct std_iad_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x0b;
#ifdef ISP_ENABLE_UVC
  desc->raw.bFirstInterface = 2;
#else
  desc->raw.bFirstInterface = 0;
#endif
  desc->raw.bInterfaceCount = 2;
  desc->raw.bFunctionClass = 0x02; /* Communications Interface Class */
  desc->raw.bFunctionSubClass = 0x02; /* Abstract Control Mode */
  desc->raw.bFunctionProtocol = 0x00;
  desc->raw.iFunction = 0;

  append_as_child(parent, &desc->head);
}

int usb_get_device_desc(void *p_dst, int dst_len, int idx_manufacturer, int idx_product, int idx_serial)
{
  struct usb_dev_desc dev_desc = { 0 };

  build_dev_desc(&dev_desc, NULL, NULL, idx_manufacturer, idx_product, idx_serial);
  update(&dev_desc.head);

  return generate(&dev_desc.head, p_dst, dst_len);
}

int uvc_get_device_desc(void *p_dst, int dst_len, int idx_manufacturer, int idx_product, int idx_serial)
{
  struct usb_dev_desc dev_desc = { 0 };

  build_uvc_dev_desc(&dev_desc, NULL, NULL, idx_manufacturer, idx_product, idx_serial);
  update(&dev_desc.head);

  return generate(&dev_desc.head, p_dst, dst_len);
}

int usb_get_device_qualifier_desc(void *p_dst, int dst_len)
{
  uint8_t *dst = p_dst;

  if (dst_len < 10)
    return -1;

  dst[0] = 0x0a; /* bLength = 10 */
  dst[1] = 0x06; /* dev qualifier desc type */
  dst[2] = 0x00; /* bcdUSB low */
  dst[3] = 0x02; /* bcdUSB high */
  dst[4] = 0xEF; /* bDeviceClass */
  dst[5] = 0x02; /* bDeviceSubClass */
  dst[6] = 0x01; /* bDeviceProtocol */
  dst[7] = 0x40; /* bMaxPacketSize0 64 */
  dst[8] = 0x01; /* bNumConfigurations */
  dst[9] = 0x00; /* bReserved */

  return dst[0];
}

int usb_get_lang_string_desc(void *p_dst, int dst_len)
{
  uint8_t *dst = p_dst;

  if (dst_len < 4)
    return -1;

  dst[0] = 0x04; /* bLength = 4 */
  dst[1] = 0x03; /* string descriptor */
  dst[2] = 0x09; /* United States */
  dst[3] = 0x04; /* United States */

  return dst[0];
}

int usb_get_manufacturer_string_desc(void *p_dst, int dst_len)
{
  return usb_get_string_desc(p_dst, dst_len, DEV_MANUFACTURER_STRING);
}

int usb_get_product_string_desc(void *p_dst, int dst_len)
{
  return usb_get_string_desc(p_dst, dst_len, DEV_PRODUCT_STRING);
}

int usb_get_serial_string_desc(void *p_dst, int dst_len)
{
  char serial[13];

  gen_serial(serial);
  return usb_get_string_desc(p_dst, dst_len, serial);
}

static void build_usb_cdc_conf_desc(struct usb_cdc_conf_desc *desc, int max_packet_size)
{
	  	build_usb_conf_desc(&desc->conf_desc, &desc->cdc_iad_desc.head);
    	build_std_iad_desc(&desc->cdc_iad_desc, &desc->cdc_ctrl_itf.head, &desc->conf_desc.head);
    	build_std_itf_desc(&desc->cdc_ctrl_itf, &desc->hdr_func_desc.head, &desc->cdc_iad_desc.head, 1, 0,
                            0x02,/* Communications Interface Class */
                            0x02,/* Abstract Control Model */
                            0x01);/* AT Commands: V.250 etc */
        build_cdc_hdr_func_desc(&desc->hdr_func_desc, &desc->acm_func_desc.head, &desc->cdc_ctrl_itf.head);
        build_cdc_acm_func_desc(&desc->acm_func_desc, &desc->union_func_desc.head, &desc->hdr_func_desc.head);
        build_cdc_union_func_desc(&desc->union_func_desc, &desc->call_mgt_func_desc.head, &desc->acm_func_desc.head, 0, 1);
        build_cdc_call_mgt_func_desc(&desc->call_mgt_func_desc, &desc->cdc_acm_ctrl_ep_desc.head, &desc->union_func_desc.head, 1);
        build_std_ep_desc(&desc->cdc_acm_ctrl_ep_desc, &desc->cdc_data_itf.head, &desc->call_mgt_func_desc.head,
                           0x81, /* IN ep */
                           0x03, /* irq */
                           8, /* max packet size */
                           8); /* interval */
        build_std_itf_desc(&desc->cdc_data_itf, &desc->cdc_acm_data_in_ep_desc.head, &desc->cdc_acm_ctrl_ep_desc.head, 2, 1,
							0x0a,/* cdc data itf */
							0x00,/* undefined */
							0x00);/* undefined */
        build_std_ep_desc(&desc->cdc_acm_data_in_ep_desc, &desc->cdc_acm_data_out_ep_desc.head, &desc->cdc_data_itf.head,
                          	0x04, /* OUT ep */ // orig: 0x04
                            0x02, /* bulk */
							max_packet_size, /* max packet size */
                            0);
        build_std_ep_desc(&desc->cdc_acm_data_out_ep_desc, NULL, &desc->cdc_acm_data_in_ep_desc.head,
                           0x82, /* IN ep */ // orig: 0x83
                           0x02, /* bulk */
						   max_packet_size, /* max packet size */
                           0);
}

static void build_uvc_conf_desc(struct usb_conf_desc *desc, struct usb_desc_head *next, uvc_desc_conf *p_conf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.update = update_usb_conf_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x02;
  desc->raw.wTotalLength = desc->raw.bLength;
  desc->raw.bNumInterfaces = 4;
  desc->raw.bConfigurationValue = 1;
  desc->raw.iConfiguration = 0;
  desc->raw.bmAttributes = 0xc0; /* self powered */
  desc->raw.bMaxPower = 50; /* 100 ma */
}


static void build_uvc_iad_desc(struct uvc_iad_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
                               uvc_desc_conf *p_conf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x0b;
  desc->raw.bFirstInterface = 0;
  desc->raw.bInterfaceCount = 2;
  desc->raw.bFunctionClass = CC_VIDEO;
  desc->raw.bFunctionSubClass = SC_VIDEO_INTERFACE_COLLECTION;
  desc->raw.bFunctionProtocol = PC_PROTOCOL_UNDEFINED;
  desc->raw.iFunction = 0;

  append_as_child(parent, &desc->head);
}

static void build_uvc_std_vc_desc(struct uvc_std_vc_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
								  uvc_desc_conf *p_conf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x04;
  desc->raw.bInterfaceNumber = 0;
  desc->raw.bAlternateSetting = 0;
  desc->raw.bNumEndpoints = 0;
  desc->raw.bInterfaceClass = CC_VIDEO;
  desc->raw.bInterfaceSubClass = SC_VIDEOCONTROL;
  desc->raw.bInterfaceProtocol = PC_PROTOCOL_15;
  desc->raw.iInterface = 0;

  append_as_child(parent, &desc->head);
}

static void update_uvc_class_vc_desc(struct usb_desc_head *head)
{
  struct uvc_class_vc_desc *desc = container_of(head, struct uvc_class_vc_desc, head);

  desc->raw.wTotalLength += get_children_len(desc->head.children);
}

