uyencorki/uvc-ai-stm32/Lib/Camera_Middleware/ISP_Library/isp/USBX/Src/usb_desc.c
static void build_uvc_class_vc_desc(struct uvc_class_vc_desc *desc, struct usb_desc_head *next,
                                    struct usb_desc_head *parent, uvc_desc_conf *p_conf)
{
  const int vs_nb = 1;

  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.update = update_uvc_class_vc_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = VC_HEADER;
  desc->raw.bcdUVC = 0x0150;
  desc->raw.wTotalLength = 12 + vs_nb;;
  desc->raw.dwClockFrequency =48000000;
  desc->raw.bInCollection = vs_nb;
  for (int i = 0; i < vs_nb; i++)
    desc->raw.baInterfaceNr[i] = i + 1;

  append_as_child(parent, &desc->head);
}

static void build_uvc_camera_terminal_desc(struct uvc_camera_terminal_desc *desc, struct usb_desc_head *next,
                                           struct usb_desc_head *parent, uvc_desc_conf *p_conf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = VC_INPUT_TERMINAL;
  desc->raw.bTerminalID = 1;
  desc->raw.wTerminalType = ITT_CAMERA;
  desc->raw.bAssocTerminal = 0;
  desc->raw.iTerminal = 0;
  desc->raw.wObjectiveFocalLengthMin = 0;
  desc->raw.wObjectiveFocalLengthMax = 0;
  desc->raw.wOcularFocalLength = 0;
  desc->raw.bControlSize = 3;
  for (int i = 0; i < 3; i++)
    desc->raw.bmControls[i] = 0;

  append_as_child(parent, &desc->head);
}

static void build_uvc_output_term_desc(struct uvc_output_term_desc *desc, struct usb_desc_head *next,
                                       struct usb_desc_head *parent, uvc_desc_conf *p_conf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = VC_OUTPUT_TERMINAL;
  desc->raw.bTerminalID = 2;
  desc->raw.wTerminalType = TT_STREAMING;
  desc->raw.bAssocTerminal = 0;
  desc->raw.bSourceID = 1;
  desc->raw.iTerminal = 0;

  append_as_child(parent, &desc->head);
}

static void build_uvc_std_vs_desc(struct uvc_std_vs_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
								  uvc_desc_conf *p_conf, int alt_nb, int ep_nb)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 0x04;
  desc->raw.bInterfaceNumber = 1;
  desc->raw.bAlternateSetting = alt_nb;
  desc->raw.bNumEndpoints = ep_nb;
  desc->raw.bInterfaceClass = CC_VIDEO;
  desc->raw.bInterfaceSubClass = SC_VIDEOSTREAMING;
  desc->raw.bInterfaceProtocol = PC_PROTOCOL_UNDEFINED;
  desc->raw.iInterface = 0;

  append_as_child(parent, &desc->head);
}

static void update_uvc_vs_input_desc(struct usb_desc_head *head)
{
  struct uvc_vs_input_desc *desc = container_of(head, struct uvc_vs_input_desc, head);

  desc->raw.wTotalLength += get_children_len(desc->head.children);
}

static void build_uvc_vs_input_desc(struct uvc_vs_input_desc *desc, struct usb_desc_head *next,
                                    struct usb_desc_head *parent, uvc_desc_conf *p_conf, int format_nb)
{
  assert(format_nb <= ARRAY_LEN(desc->raw.bmaControls));

  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.update = update_uvc_vs_input_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = VS_INPUT_HEADER;
  desc->raw.bNumFormats = format_nb;
  desc->raw.wTotalLength = desc->head.bLength;
  desc->raw.bEndpointAddress = 0x81;
  desc->raw.bmInfo = 0;
  desc->raw.bTerminalLink = 2;
  desc->raw.bStillCaptureMethod = 0;
  desc->raw.bTriggerSupport = 0;
  desc->raw.bTriggerUsage = 0;
  desc->raw.bControlSize = 1;
  desc->raw.bmaControls[0] = 0;

  append_as_child(parent, &desc->head);
}

static void build_uvc_yuv422_fmt_desc(struct uvc_yuv422_fmt_desc *desc, struct usb_desc_head *next,
                                      struct usb_desc_head *parent, uvc_desc_conf *p_conf)
{
  const uint8_t YUV422_guid[] = {'Y', 'U', 'Y', '2', 0x00, 0x00, 0x10, 0x00,
                 0x80, 0x00, 0x00, 0xAA, 0x00, 0x38, 0x9B, 0x71};
                 int i;

  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = VS_FORMAT_UNCOMPRESSED;
  desc->raw.bFormatIndex = 1;
  desc->raw.bNumFrameDescriptors = 1;
  for (i = 0; i < 16; i++)
    desc->raw.guidFormat[i] = YUV422_guid[i];
  desc->raw.bBitsPerPixel = 16;
  desc->raw.bDefaultFrameIndex = 1;
  desc->raw.bAspectRatioX = 0;
  desc->raw.bAspectRatioY = 0;
  desc->raw.bmInterlaceFlags = 0;
  desc->raw.bCopyProtect = 0;

  append_as_child(parent, &desc->head);
}

static void build_uvc_yuv422_frame_desc(struct uvc_yuv422_frame_desc *desc, struct usb_desc_head *next,
                                        struct usb_desc_head *parent, uvc_desc_conf *p_conf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = VS_FRAME_UNCOMPRESSED;
  desc->raw.bFrameIndex = 1;
  desc->raw.bmCapabilities = 2;
  desc->raw.wWidth = p_conf->width;
  desc->raw.wHeight = p_conf->height;
  desc->raw.dwMinBitRate = desc->raw.wWidth * desc->raw.wHeight * p_conf->fps * 16;
  desc->raw.dwMaxBitRate = desc->raw.dwMinBitRate;
  desc->raw.dwDefaultFrameInterval = 10000000 / p_conf->fps;
  desc->raw.bFrameIntervalType = 1;
  desc->raw.dwFrameInterval[0] = 10000000 / p_conf->fps;

  append_as_child(parent, &desc->head);
}

static void build_uvc_color_desc(struct uvc_color_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
								 uvc_desc_conf *p_conf)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = CS_INTERFACE;
  desc->raw.bDescriptorSubType = VS_COLORFORMAT;
  desc->raw.bColorPrimaries = 1;
  desc->raw.bTransferCharacteristics = 1;
  desc->raw.bMatrixCoefficients = 4;

  append_as_child(parent, &desc->head);
}

static void build_uvc_vs_ep_desc(struct uvc_vs_ep_desc *desc, struct usb_desc_head *next, struct usb_desc_head *parent,
								 uvc_desc_conf *p_conf, int max_packet_size)
{
  desc->head.bLength = sizeof(desc->raw);
  desc->head.raw = (uint8_t *) &desc->raw;
  desc->head.gen = gen_default_desc;
  desc->head.next = next;
  desc->raw.bLength = sizeof(desc->raw);
  desc->raw.bDescriptorType = 5;
  desc->raw.bEndpointAddress = 0x81;
  desc->raw.bmAttributes = 0x05;
  desc->raw.wMaxPacketSize = max_packet_size;
  desc->raw.bInterval = 1;

  append_as_child(parent, &desc->head);
}

static void build_uvc_yuv422_conf_desc(struct uvc_yuv422_conf_desc *desc, uvc_desc_conf *p_conf, int max_packet_size, int usb_max_packet_size)
{
        build_uvc_conf_desc(&desc->conf_desc, &desc->iad_desc.head, p_conf);
        build_uvc_iad_desc(&desc->iad_desc, &desc->std_vc_desc.head, &desc->conf_desc.head, p_conf);
        build_uvc_std_vc_desc(&desc->std_vc_desc, &desc->class_vc_desc.head, &desc->iad_desc.head, p_conf);
        build_uvc_class_vc_desc(&desc->class_vc_desc, &desc->cam_desc.head, &desc->std_vc_desc.head, p_conf);
        build_uvc_camera_terminal_desc(&desc->cam_desc, &desc->tt_desc.head, &desc->class_vc_desc.head, p_conf);
        build_uvc_output_term_desc(&desc->tt_desc, &desc->std_vs_alt0_desc.head, &desc->class_vc_desc.head, p_conf);
        build_uvc_std_vs_desc(&desc->std_vs_alt0_desc, &desc->vs_input_desc.head, &desc->iad_desc.head, p_conf, 0, 0);
        build_uvc_vs_input_desc(&desc->vs_input_desc, &desc->fb_fmt_desc.head, &desc->std_vs_alt0_desc.head, p_conf, 1);
        build_uvc_yuv422_fmt_desc(&desc->fb_fmt_desc, &desc->fb_frame_desc.head, &desc->vs_input_desc.head, p_conf);
        build_uvc_yuv422_frame_desc(&desc->fb_frame_desc, &desc->color_desc.head, &desc->fb_fmt_desc.head, p_conf);
        build_uvc_color_desc(&desc->color_desc, &desc->std_vs_alt1_desc.head, &desc->fb_fmt_desc.head, p_conf);
        build_uvc_std_vs_desc(&desc->std_vs_alt1_desc, &desc->ep_desc.head, &desc->iad_desc.head, p_conf, 1, 1);
        build_uvc_vs_ep_desc(&desc->ep_desc, &desc->cdc_iad_desc.head, &desc->std_vs_alt1_desc.head, p_conf, max_packet_size);
        build_std_iad_desc(&desc->cdc_iad_desc, &desc->cdc_ctrl_itf.head, &desc->ep_desc.head);
        build_std_itf_desc(&desc->cdc_ctrl_itf, &desc->hdr_func_desc.head, &desc->cdc_iad_desc.head, 1, 2,
                           0x02,/* Communications Interface Class */
                           0x02,/* Abstract Control Model */
                           0x01);/* AT Commands: V.250 etc */
        build_cdc_hdr_func_desc(&desc->hdr_func_desc, &desc->acm_func_desc.head, &desc->cdc_ctrl_itf.head);
        build_cdc_acm_func_desc(&desc->acm_func_desc, &desc->union_func_desc.head, &desc->hdr_func_desc.head);
        build_cdc_union_func_desc(&desc->union_func_desc, &desc->call_mgt_func_desc.head, &desc->acm_func_desc.head, 2, 3);
        build_cdc_call_mgt_func_desc(&desc->call_mgt_func_desc, &desc->cdc_acm_ctrl_ep_desc.head, &desc->union_func_desc.head, 3);
        build_std_ep_desc(&desc->cdc_acm_ctrl_ep_desc, &desc->cdc_data_itf.head, &desc->call_mgt_func_desc.head,
                          0x82, /* IN ep */
                          0x03, /* irq */
                          8, /* max packet size */
                          8); /* interval */
        build_std_itf_desc(&desc->cdc_data_itf, &desc->cdc_acm_data_in_ep_desc.head, &desc->cdc_acm_ctrl_ep_desc.head, 2, 3,
                           0x0a,/* cdc data itf */
                           0x00,/* undefined */
                           0x00);/* undefined */
        build_std_ep_desc(&desc->cdc_acm_data_in_ep_desc, &desc->cdc_acm_data_out_ep_desc.head, &desc->cdc_data_itf.head,
                          0x04, /* OUT ep */
                          0x02, /* bulk */
						  usb_max_packet_size, /* max packet size */
                          0);
        build_std_ep_desc(&desc->cdc_acm_data_out_ep_desc, NULL, &desc->cdc_acm_data_in_ep_desc.head,
                          0x83, /* IN ep */
                          0x02, /* bulk */
						  usb_max_packet_size, /* max packet size */
                          0);
}

