uyencorki/uvc-ai-stm32/Lib/Camera_Middleware/ISP_Library/isp/USBX/Src/usb_desc.c
static int build_hs_usb_configuration_desc(uint8_t *p_dst, int dst_len)
{
  struct usb_cdc_conf_desc desc = { 0 };
  int max_packet_size = 512;

  build_usb_cdc_conf_desc(&desc, max_packet_size);
  update(&desc.conf_desc.head);
  return generate(&desc.conf_desc.head, p_dst, dst_len);
}

static int build_fs_usb_configuration_desc(uint8_t *p_dst, int dst_len)
{
  struct usb_cdc_conf_desc desc = { 0 };
  int max_packet_size = 64;

  build_usb_cdc_conf_desc(&desc, max_packet_size);
  update(&desc.conf_desc.head);
  return generate(&desc.conf_desc.head, p_dst, dst_len);
}

int usb_get_configuration_desc(void *p_dst, int dst_len, usb_desc_conf *p_conf)
{
  if (p_conf->is_hs)
    return build_hs_usb_configuration_desc(p_dst, dst_len);
  else
    return build_fs_usb_configuration_desc(p_dst, dst_len);
}

static int build_hs_uvc_configuration_desc(uint8_t *p_dst, uvc_desc_conf *p_conf, int dst_len)
{
  struct uvc_yuv422_conf_desc desc = { 0 };
  int max_packet_size = 1024 | ((USBL_PACKET_PER_MICRO_FRAME - 1) << 11);
  assert(USBL_PACKET_PER_MICRO_FRAME >= 1 && USBL_PACKET_PER_MICRO_FRAME <= 3);
  int usb_max_packet_size = 512;

  build_uvc_yuv422_conf_desc(&desc, p_conf, max_packet_size, usb_max_packet_size);
  update(&desc.conf_desc.head);
  return generate(&desc.conf_desc.head, p_dst, dst_len);
}

static int build_fs_uvc_configuration_desc(uint8_t *p_dst, uvc_desc_conf *p_conf, int dst_len)
{
  struct uvc_yuv422_conf_desc desc = { 0 };
  int max_packet_size = 1023;
  int usb_max_packet_size = 64;

  build_uvc_yuv422_conf_desc(&desc, p_conf, max_packet_size, usb_max_packet_size);
  update(&desc.conf_desc.head);
  return generate(&desc.conf_desc.head, p_dst, dst_len);
}

int uvc_get_configuration_desc(void *p_dst, int dst_len, uvc_desc_conf *p_conf)
{
  if (p_conf->is_hs)
    return build_hs_uvc_configuration_desc(p_dst, p_conf, dst_len);
  else
    return build_fs_uvc_configuration_desc(p_dst, p_conf, dst_len);
}
